/* 
  Localizable.strings
  Sao's PDF Kit

  Created by 河野 さおり on 2016/02/23.
  Copyright © 2016年 河野 さおり. All rights reserved.
*/

//File error alert.massageText
"FILE_ERROR_MESSAGETEXT" = "ファイルパスエラー:";

//File error alert.informativeText
"FILE_ERROR_INFOTEXT" = "は存在しません。";

//PDF read error status window.messageText
"PDF_READ_ERROR_MESSAGETEXT" = "PDFの読み込みに失敗しました。";

//PDF read error status window.informativeText
"PDF_READ_ERROR_INFOTEXT" = "ファイルが存在しない、あるいはファイルに問題があります。";

//Button Store Work Stade Action End messageText
"SAVE_FILELIST_MESSAGETEXT" = "保存完了";

//Button Store Work Stade Action End messageText
"SAVE_FILELIST_INFOTEXT" = "作業状況一時ファイルの保存に成功しました。";

//Page range text
"ALL_PAGES" = "全ページ";

//View menu item title strings
"MnTitleEnterFullScreen" = "フルスクリーンにする";
"MnTitleExitFullScreen" = "フルスクリーンを解除";

//PDFOutline not exist dialog message
"NotExistOutline_msg" = "このドキュメントにはしおりのデータが含まれていません。";
"NotExistOutline_info" = "しおりが必要な場合は、しおりメニューからしおり作成メニューを選択してください。";

//table view header title
"RESULT" = "結果：";

//New Bookmark Undefined Label
"UntitledLabal" = "名称未設定";

//New Bookmark from Selection NoSelection dialog message
"NoSelectBM_msg" = "選択範囲から新規しおり作成エラー：";
"NoSelectBM_info" = "何も選択されていません。\nしおりを設定したい場所を選択してから、メニュー・コマンドを実行してください。";

//Menu item Show or Hide Bookmark Panel
"ShowBM" = "しおりパネルを表示";
"HideBM" = "しおりパネルを隠す";

//Menu item Show or Hide Font Panel
"ShowFont" = "フォントパネルを表示";
"HideFont" = "フォントパネルを隠す";

//Menu item Show or Hide Color Panel
"ShowColor" = "カラーパネルを表示";
"HideColor" = "カラーパネルを隠す";

//Bookmark panel empty input error message
"OLLabel_msg" = "ラベルが入力されていません。";
"PageIndex_msg" = "移動先のページインデックスが入力されていません。";
"PointX_msg" = "移動先の位置のX座標が入力されていません。";
"PointY_msg" = "移動先の位置のY座標が入力されていません。";
"EmptyErr_info" = "この値に空白は許可されません。入力を正しく行ってください。";

//Menu item Show or Hide Text Panel
"ShowTP" = "テキストパネルを表示";
"HideTP" = "テキストパネルを隠す";

//Document encrypted allert dialog
"EncryptedMsg" = "この文書はパスワードによって暗号化されています。";
"EncryptedInfo" = "処理を続行した場合、暗号化は解除されます。暗号化を解除しない場合は、キャンセルボタンをクリックし、「PDF」メニューから「文書を暗号化...」を選択して、暗号化を実行してください。ドキュメントは暗号化されて保存されます。";

//Document Changed Alert Dialog Button Title
"Continue" = "続行";
"Cancel" = "キャンセル";

//AllertWithOKBtn
"LockedMsg" = "テキストの取得にはこのドキュメントをコピーする権限が必要です。";
"LockedInfo" = "コピー操作のロックを解除するには、「ファイル」メニューから「パスワードを入力...」を選択してください。";

//for split document
"Choose" = "選択";
"ChooseFolder" = "保存先のフォルダを選択してください。";
"fileNameAlertMsg" = "はすでに存在しています。置き換えてもよろしいですか？";
"fileNameAlertInfo" = "同じ名前のファイルまたはフォルダがすでに存在しています。これを置き換えると現在の内容が上書きされます。";
"Suspend" = "処理を中断する";
"Replace" = "置き換え";
"PRangeMsg" = "ページ範囲指定エラー：";
"PRangeInfo" = "ページ範囲の指定が不正です。";
"PageEmpty" = "ページ範囲が指定されていません。";
"CharError" = "ページ範囲の指定に不適切な文字が使用されています。";
"AllPages" = "すべてのページを削除することはできません。";

//pass win
"UnlockMsg" = "このドキュメントの操作に関する完全な権限を所有していません。";
"UnlockInfo" = "このドキュメントの完全な権限を有効にするには、オーナー・パスワードを入力してください。";
"UnlockCopyMsg" = "この書類をコピーするための権限がありません。";
"UnlockCopyInfo" = "コピー操作のロックを解除するには、オーナーパスワードを入力してください。";
"UnlockPrintMsg" = "この書類をプリントするための権限がありません。";
"UnlockPrintInfo" = "プリント操作のロックを解除するには、オーナーパスワードを入力してください。";
"UnlockEditMsg" = "文書情報を編集するための権限がありません。";
"UnlockEditInfo" = "文書情報を操作のロックを解除するには、オーナーパスワードを入力してください。";

//EncryptPanel alert
"passSameMsg" = "ユーザ・パスワードとオーナー・パスワードは別の文字でなければなりません。";
"oNoneMsg" = "コピー／プリント操作のロックには、オーナーパスワードが必要です。";
"oNoneInfo" = "オーナーパスワードとその確認用フィールドにパスワードを入力してください";
"uPassMsg" = "ユーザー・パスワードの入力値が確認用の入力値と異なっています。";
"oPassMsg" = "オーナー・パスワードの入力値が確認用の入力値と異なっています。";
"passInfo" = "登録用と確認用のテキストフィールドにパスワードを再入力後、再度更新処理を試みてください。";

//Info Panel
"Encrypted" = "暗号化";
"None" = "なし";
"Allow" = "許可";
"Forbid" = "不可";
"Unlock" = "変更するには鍵をクリックしてください";
"Lock" = "変更できないようにするには鍵をクリックしてください";


